{
    "melee_prot": "Reduces melee damage by 1 - 0.92 ^ (2 * level).",
    "projectile_prot": "Reduces projectile damage by 1 - 0.92 ^ (2 * level).",
    "magic_prot": "Reduces magic damage by 1 - 0.92 ^ (2 * level).",
    "blast_prot": "Reduces explosion damage by 1 - 0.92 ^ (2 * level).",
    "fire_prot": "Reduces fire damage by 1 - 0.92 ^ (2 * level). Reduces fire duration by 10% per level.",
    "feather_falling": "Reduces fall damage by 1 - 0.88 ^ (3 * level).",
    "shielding": "Gain level * 20% effective Armor when taking damage from an enemy within 2.5 blocks. If Shielding applies to damage that disables a shield, the enchantment is disabled for 5 seconds.",
    "poise": "Gain level * 20% effective Armor when above 90% max health.",
    "inure": "Gain level * 20% effective Armor when taking the same type of mob damage consecutively.",
    "steadfast": "Scaling with the percentage of health missing, gain up to level * 20% effective Armor, but lose up to level * 10% Speed.",
    "evasion": "Gain level * 20% effective Agility when taking damage from a source further than 4 blocks from the player.",
    "reflexes": "Gain level * 20% effective Agility when there are more than 4 enemies within 8 blocks.",
    "ethereal": "Gain level * 20% effective Agility on hits taken within 1.5 seconds of any previous hit.",
    "tempo": "Gain level * 20% effective Agility on the first hit taken after 5 seconds of taking no damage.",
    "adaptability": "Allows secondary enchants to work on the defense type you have the most of rather than only one of Armor / Agility.",
    "second_wind": "Damage applied to the lower half of your max health (health below 50%) is multiplied by 0.9^level.",
    "spell_power_base": "Increases the damage of spells. Only works with Mage skills. Stacks with Magic Damage attribute.",
    "knockback": "Adds level * 3 blocks to your knockback on melee strikes.",
    "fire_aspect_m": "Adds level * 4 seconds of burning to the target of a melee hit.",
    "fire_aspect_p": "Adds level * 4 seconds of burning to the target of a projectile hit.",
    "ice_aspect_m": "Adds level * 10% slowness for 5 seconds to the target of a melee hit. Deals 1 extra damage to Blazes.",
    "ice_aspect_p": "Adds level * 10% slowness for 5 seconds to the target of a projectile hit. Deals 1 extra damage to Blazes.",
    "thunder_aspect_m": "Adds level * 10% chance to stun a mob on melee hit for 50 ticks (10 for elites.) Deals an extra 1 damage to Guardians and Iron Golems.",
    "thunder_aspect_p": "Adds level * 10% chance to stun a mob on projectile hit for 50 ticks (10 for elites.) Deals an extra 1 damage to Guardians and Iron Golems.",
    "decay": "Applies a Decay effect that deals 1 damage every 40/level ticks for 4 seconds.",
    "smite": "Deal level * 2 damage to undead enemies.",
    "hex_eater": "Adds level * 0.5 extra damage per debuff on the target.",
    "duelist": "Deals level * 2 non-undead human-like enemies.",
    "slayer": "Deals level * 2 damage to anything not affected by Smite or Duelist.",
    "abyssal": "While equipped, deal an additional level * 10% damage to all enemies in water.",
    "regicide": "While equipped, you deal an additional level * 10% damage to elite enemies and level * 5% damage to boss enemies.",
    "inferno": "Increases fire damage from items or abilities by level each damage tick. Fire resistant mobs take half the damage for 4 seconds.",
    "chaotic": "Deals anywhere between -level and +level damage. Halved for sweep attacks.",
    "life_drain": "Heals the player for sqrt(level) for critical hits and 0.5 * sqrt(level) / sqrt(attack speed) * Attack Cooldown for non-crits.",
    "sweeping_edge": "Increases sweep damage by 1 + attack damage * (level / (level + 1)).",
    "arcane_tust": "Non-critical attacks damage enemies 3 blocks in front of you in a 0.6 block wide line. 1 + melee damage dealt * level / (level + 1).",
    "bleeding": "Applies Bleed for 5 seconds to mobs struck by the weapon. Bleed applies level * 10% slowness and weakness to mobs under 50% HP.",
    "quake": "When you kill an enemy with melee, nearby enemies in a 3 block cube take level * 10% of the damage. Fire/Thunder/Ice aspect, Decay, and Bleed apply to affected mobs.",
    "flame": "Projectiles set enemies on fire for 5 seconds.",
    "frost": "Inflicts 20% Slowness for 4 seconds to the target. Blazes take +1 extra damage.",
    "spark": "50% chance to stun targets for 0.5 seconds. Guardians and Golems take +1 extra damage.",
    "punch": "Projectiles gain level * 3 blocks of knockback.",
    "point_blank": "Deals level * 2 more damage to targets within 8 blocks of the player.",
    "sniper": "Deals level * 2 more damage to targets more than 12 blocks from the player.",
    "recoil": "You are knocked back when firing the crossbow. Crouching prevents the effect but causes a 0.5 second cooldown.",
    "retrieval": "Arrows have a level * 10% chance to not be consumed.",
    "multishot": "Fire 3 projectiles at once.",
    "piercing": "Arrows can pass through a number of entities equal to the enchantment's level.",
    "looting": "Increases common loot drops by (enchantment level) chances.",
    "efficiency": "Increases the speed at which you break blocks.",
    "fortune": "Increases the resources gained when breaking ores and certain blocks.",
    "lure": "Decreases the time spent waiting for a fish by level * 5 seconds.",
    "silk_touch": "Allows blocks to drop themselves instead of their normal drop.",
    "multitool": "Level 1 allows the tool to cycle between an axe and shovel. Level 2 adds a pickaxe to the cycle.",
    "sapper": "Restore (enchantment level) Health when breaking a spawner.",
    "debarking": "Removes bark from logs you break.",
    "barking": "Restores bark to logs you break.",
    "eruption": "Deal level * 4 damage in a 5 block radius when breaking a spawner. Fire, Ice, Thunder aspect and Decay apply to affected mobs. Adrenaline and Sapper apply to nearby players.",
    "riptide": "A trident with Riptide can only be thrown in water. When thrown, you are launched a distance based on Riptide's level.",
    "unbreaking": "Gear breaks level + 1 times slower.",
    "unbreakable": "No durability is taken when used.",
    "mending": "Items with Mending are repaired by 2 durability per XP orb consumed.",
    "infinity": "Bows and crossbows don't consume arrows, potions and food are not consumed when used.",
    "darksight": "Provides the player with Night Vision while equipped.",
    "radiant": "When held in any hand, provides Night Vision and Glowing for 30 seconds.",
    "regen": "Regain sqrt(level) every 3 seconds, in small increments 4 times per second.",
    "gills": "Provides the player with Water Breathing while equipped.",
    "aqua_affinity": "Removes penalty to mining speed while underwater.",
    "depth_strider": "Move level * 33% faster when in water.",
    "respiration": "Extends breathing time underwater by level * 15 seconds.",
    "soul_speed": "When on soul sand or soul soil, your speed will increase by level * 10.5%.",
    "intuition": "Gain 50% more experience.",
    "sustenance": "Increases healing received by level * 10%.",
    "adrenaline": "Upon attacking an enemy, you gain level * 10% speed for 3 seconds. Upon breaking a spawner with a pickaxe, you gain level * 5% speed for 6 seconds.",
    "weightless": "May be held in the offhand without incurring a debuff from the Two Handed curse.",
    "aptitude": "Decreases the cooldown of all of your skills by level * 5%.",
    "triage": "Increases the amount of healing you do to others by level * 5%.",
    "persistence": "You will not drop this item on death.",
    "jungle_s_nourishment": "The food fully refills hunger bar. Gives Resistance for 4 seconds and instant health II.",
    "resurrection": "Saves the player from death once.",
    "void_tther": "Saves the player from death in the void once.",
    "exorcism": "Deals damage to mobs summoned in the Valley of Forgotten Pharaohs.",
    "instant_drink": "Right-click to instantly be granted the item's effects.",
    "ashes_of_eternity": "Saves player from death once a week using the same mechanics as Resurrection and Void Tether. The enchant is then removed until the next weekly reset.",
    "rage_of_the_keter": "The food restores 6 hunger points and 6 saturation points and can be eaten at full hunger. Gives the player +15% to all damage and +15% speed for 15 seconds.",
    "throwing_knife": "Right-click to use the item and instantly fire an arrow.",
    "corruption": "Debuffs the player if more than one item with this enchantment is equipped.",
    "irreparability": "Prevents the enchanted item from being repaired.",
    "two_handed": "Debuffs the player if they are also holding something in their off hand, unless it has the weightless enchantment. Two Handed swords count as two swords for Rogue.",
    "emphemerality": "Item vanishes when changing inventories or when the player teleports or logs out.",
    "binding": "Item can only be removed when it shatters or the player dies.",
    "vanishing": "Item shatters on death. Level 2 completely deletes the item on death.",
    "crippling": "Players are slowed by 30% when hit.",
    "shrapnel": "Take level damage when mining a spawner.",
    "anemia": "Healing effects reduced by level * 10%.",
    "starvation": "Removes saturation points and hunger points (in that order) equal to level.",
    "ineptitude": "Increases the cooldown of all your skills by level * 5%.",
    "clucking": "Players will occasionally hear clucking.",
    "oinking": "Players will occasionally hear oinking.",
    "baaing": "Players will occasionally hear baaing.",
    "gilded": "Players gain an aura of particles when used. Voting reward.",
    "stylish": "Players gain an aura of black particles.",
    "festive": "Players gain an aura of festive particles.",
    "divine_aura": "Players and attacked enemies gain an aura of divine particles.",
    "stamina": "After taking damage, or dealing melee/projectile damage, gain (level * 2.5)% melee and projectile damage per level, for 5 seconds. Stacks up to 4 times.",
    "explosive": "Critical arrows you shoot deal an additional (level * 10)% splash damage in a 2-block radius, which also applies any aspects, decay and bleeding you may have.",
    "multiload": "Upon reloading the crossbow, consume up to (level) extra arrows and instantly reload the crossbow after firing for each extra arrow consumed.",
    "excavator": "Mine blocks in a 3x3 shape around the target block. Doesn't break spawners or chests.",
    "wind_aspect_m": "Launch mobs on melee hit by (level) blocks and apply Slow Falling for 1 second.",
    "wind_aspect_p": "Launch mobs on projectile hit by (level) blocks and apply Slow Falling for 1 second.",
    "earth_aspect_m": "On melee hit, grants (level * 5)% damage reduction for 3 seconds. Also applies upon mining a spawner.",
    "earth_aspect_p": "On projectile hit, grants (level * 5)% damage reduction for 3 seconds. Also applies upon mining a spawner.",
    "trivium": "When hitting 3 or more mobs with a magical ability, ddeal (level * 10)% more magic damage.",
    "projectile_fragility": "Increases projectile damage by 1 - 0.92 ^ (-2 * level).",
    "melee_fragility": "Increases melee damage by 1 - 0.92 ^ (-2 * level).",
    "magic_fragility": "Increases magic damage by 1 - 0.92 ^ (-2 * level).",
    "blast_fragility": "Increases blast damage by 1 - 0.92 ^ (-2 * level).",
    "fire_fragility": "Increases fire damage by 1 - 0.92 ^ (-2 * level)."
}